# MetalPerforationsShader Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Metal..::..MetalPerforationsShader Property
Metal Class See Also
---
The property labeled "Image" from the "Metal" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MetalPerforationsShader { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MetalPerforationsShader As String
	Get
```

Visual C++
---
```text
public:
static property String^ MetalPerforationsShader {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
# See Also
Metal Class
Autodesk.Revit.DB.Visual Namespace